; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_3 object type_2 type_1)
 (:predicates (pred_4 ?v8 - type_2 ?v1 - type_3)
 	      (pred_2 ?v6 - object ?v1 - type_3)
	      (pred_3 ?v8 - type_2 ?v4 - type_1)
	      (pred_1 ?v8 - type_2 ?v6 - object ?v4 - type_1))

   (:action op_3
       :parameters  (?v8 - type_2 ?v5 ?v2 - type_3)
       :precondition (and  (pred_4 ?v8 ?v5))
       :effect (and  (pred_4 ?v8 ?v2)
		     (not (pred_4 ?v8 ?v5))))

   (:action op_2
       :parameters (?v8 - type_2 ?v3 - object ?v7 - type_3 ?v4 - type_1)
       :precondition  (and  (pred_2 ?v3 ?v7) (pred_4 ?v8 ?v7) (pred_3 ?v8 ?v4))
       :effect (and (pred_1 ?v8 ?v3 ?v4)
		    (not (pred_2 ?v3 ?v7)) 
		    (not (pred_3 ?v8 ?v4))))

   (:action op_1
       :parameters (?v8 - type_2 ?v3 - object ?v7 - type_3 ?v4 - type_1)
       :precondition  (and  (pred_1 ?v8 ?v3 ?v4) (pred_4 ?v8 ?v7))
       :effect (and (pred_2 ?v3 ?v7)
		    (pred_3 ?v8 ?v4)
		    (not (pred_1 ?v8 ?v3 ?v4)))))

; problem
(define (problem gripper-1-4-3)
(:domain gripper-strips)
(:objects obj_02 - type_2
obj_04 obj_07 - type_1
obj_01 obj_06 obj_09 obj_05 - type_3
obj_03 obj_10 obj_08 - object)
(:init
(pred_4 obj_02 obj_09)
(pred_3 obj_02 obj_04)
(pred_3 obj_02 obj_07)
(pred_2 obj_03 obj_06)
(pred_2 obj_10 obj_09)
(pred_2 obj_08 obj_09)
)
(:goal
(and
(pred_2 obj_03 obj_05)
(pred_2 obj_10 obj_01)
(pred_2 obj_08 obj_01)
)
)

(:constraints
  (always (forall (?b - object)
           (not (pred_1 obj_02 ?b obj_07))))
)
)

; plan
1. (op_2 obj_02 obj_10 obj_09 obj_04)
   deleted: (pred_2 obj_10 obj_09) (pred_3 obj_02 obj_04)
   added: (pred_1 obj_02 obj_10 obj_04)
   goals met: 0 of 3
2. (op_3 obj_02 obj_09 obj_01)
   deleted: (pred_4 obj_02 obj_09)
   added: (pred_4 obj_02 obj_01)
   goals met: 0 of 3
3. (op_1 obj_02 obj_10 obj_01 obj_04)
   deleted: (pred_1 obj_02 obj_10 obj_04)
   added: (pred_2 obj_10 obj_01) (pred_3 obj_02 obj_04)
   goals met: 1 of 3
4. (op_3 obj_02 obj_01 obj_06)
   deleted: (pred_4 obj_02 obj_01)
   added: (pred_4 obj_02 obj_06)
   goals met: 1 of 3
5. (op_2 obj_02 obj_03 obj_06 obj_04)
   deleted: (pred_2 obj_03 obj_06) (pred_3 obj_02 obj_04)
   added: (pred_1 obj_02 obj_03 obj_04)
   goals met: 1 of 3
6. (op_3 obj_02 obj_06 obj_05)
   deleted: (pred_4 obj_02 obj_06)
   added: (pred_4 obj_02 obj_05)
   goals met: 1 of 3
7. (op_1 obj_02 obj_03 obj_05 obj_04)
   deleted: (pred_1 obj_02 obj_03 obj_04)
   added: (pred_2 obj_03 obj_05) (pred_3 obj_02 obj_04)
   goals met: 2 of 3
8. (op_3 obj_02 obj_05 obj_09)
   deleted: (pred_4 obj_02 obj_05)
   added: (pred_4 obj_02 obj_09)
   goals met: 2 of 3
9. (op_2 obj_02 obj_08 obj_09 obj_04)
   deleted: (pred_2 obj_08 obj_09) (pred_3 obj_02 obj_04)
   added: (pred_1 obj_02 obj_08 obj_04)
   goals met: 2 of 3
10. (op_3 obj_02 obj_09 obj_01)
   deleted: (pred_4 obj_02 obj_09)
   added: (pred_4 obj_02 obj_01)
   goals met: 2 of 3
11. (op_1 obj_02 obj_08 obj_01 obj_04)
   deleted: (pred_1 obj_02 obj_08 obj_04)
   added: (pred_2 obj_08 obj_01) (pred_3 obj_02 obj_04)
   goals met: 3 of 3
